
      *This COBOL/CICS code goes with the BMS_mapset file.
      * It provides the back-end logic to the maps to allow 
      *administrators to add, edit, or delete student information.	  


       IDENTIFICATION DIVISION.
       PROGRAM-ID. STUMNT1.
       ENVIRONMENT DIVSION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SWITCHES.
           05 VALID-DATA-SW           PIC X VALUE 'Y'.
              88 VALID-DATA                 VALUE 'Y'.
       01 FLAGS.
           05 SEND-FLAG               PIC X.
              88 SEND-ERASE                 VALUE '1'.
              88 SEND-ERASE-ALARM           VALUE '2'.
              88 SEND-DATAONLY              VALUE '3'.
              88 SEND-DATAONLY-ALARM        VALUE '4'.
              
       01 WORK-FIELDS.
           05 RESPONSE-CODE            PIC S9(8) COMP.
           
       01 USER-INSTRUCTIONS.
           05 ADD-INSTRUCTION          PIC X(79) VALUE
              'Type information for new student. Then press Enter.'.
           05 CHANGE-INSTRUCTION          PIC X(79) VALUE
              'Type changes. Then press Enter.'.
           05 DELETE-INSTRUCTION          PIC X(79) VALUE
              'Press Enter to delete this student. Or press F12 to cancel'.
              
              
       01 COMMUNICATION-AREA.
           05 CA-CONTEXT-FLAG              PIC X.
               88 PROCESS-KEY-MAP                    VALUE '1'.
               88 PROCESS-ADD-STUDENT                VALUE '2'.
               88 PROCESS-CHANGE-STUDENT             VALUE '3'.
               88 PROCESS-DELETE-STUDENT             VALUE '4'.
           05 CA-STUDENT-RECORD.
               10 CA-STUDENT-NUMBER        PIC X(6).
               10 FILLER                   PIC X(112).
               
               
       COPY STUMAS.
       
       COPY STUSET1.
       
       COPY DFHAID.
       
       COPY ATTR.
       
       LINKAGE SECTION.
       
       01 DFHCOMMAREA                      PIC X(119).
           
	   
	   PROCEDURE DIVISION.
	   
	   0000-PROCESS-STUDENT.
	   
      
	       IF EIBCALEN > ZERO
		       MOVE DFHCOMMAREA TO COMMUNICATION-AREA
		   END-IF.
		   
		   EVALUATE TRUE
      	   
		       WHEN EIBCALEN = ZERO
			       MOVE LOW-VALUE TO STUMAP1O
				   SET SEND-ERASE TO TRUE
				   MOVE -1 TO STUID1L
				   PERFORM 1500-SEND-KEY-MAP
				   SET PROCESS-KEY-MAP TO TRUE
				   
      		   
			   WHEN EIBAID = DFHPF3
			       EXEC CICS
				      XCTL PROGRAM('INVMENU')
				   END-EXEC
				   
			   WHEN EIBAID = DFHPF12
			       IF PROCESS-KEY-MAP
				      EXEC CICS
				         XCTL PROGRAM('INVMENU')
				      END-EXEC
				   ELSE
				      MOVE LOW-VALUE TO STUMAP1O
					  SET SEND-ERASE TO TRUE
				      MOVE -1 TO STUID1L
				      PERFORM 1500-SEND-KEY-MAP
				      SET PROCESS-KEY-MAP TO TRUE
				   END-IF
				   
			   WHEN EIBAID = DFHCLEAR
			       IF PROCESS-KEY-MAP
				      MOVE LOW-VALUE TO STUMAP1O
					  SET SEND-ERASE TO TRUE
				      MOVE -1 TO STUID1L
				      PERFORM 1500-SEND-KEY-MAP
					ELSE
					   MOVE LOW-VALUE TO STUMAP2O
					   MOVE CA-STUDENT-ID TO STUID2O   
					   EVALUATE TRUE
					      WHEN PROCESS-ADD-STUDENT
						     MOVE ADD-INSTRUCTION TO INSTR2O
						  WHEN PROCESS-CHANGE-STUDENT
						     MOVE CHANGE-INSTRUCTION TO INSTR2O
						  WHEN PROCESS-DELETE-STUDENT
						     MOVE DELETE-INSTRUCTION TO INSTR2O
						END-EVALUATE
						MOVE -1 TO LNAMEL
						SET SEND-ERASE TO TRUE
						PERFORM 1400-SEND-DATA-MAP
						
		           END-IF
				   
			   WHEN EIBAID = DFHPA1 OR DFHPA2 OR DFHPA3
			       CONTINUE
				   
			   WHEN EIBAID = DFHENTER
			       EVALUATE TRUE
				      WHEN PROCESS-KEY-MAP
					     PERFORM 1000-PROCESS-KEY-MAP
					  WHEN PROCESS-ADD-STUDENT
					     PERFORM 2000-PROCESS-ADD-STUDENT
					  WHEN PROCESS-CHANGE-STUDENT
					     PERFORM 3000-PROCESS-CHANGE-STUDENT
					  WHEN PROCESS-DELETE-STUDENT
					     PERFORM 4000-PROCESS-DELETE-STUDENT
					END-EVALUATE
					
				WHEN OTHER
				   IF PROCESS-KEY-MAP
				     MOVE LOW-VALUE TO STUMAP1O
					 MOVE 'That key is unassigned.' TO MSG100
					 MOVE -1 TO STUID1L
					 SET SEND-DATAONLY-ALARM TO TRUE
					 PERFORM 1500-SEND-KEY-MAP
				   ELSE
				     MOVE LOW-VALUE TO STUMAP2O
					 MOVE -1 TO LNAMEL
					 MOVE 'That key is unassigned.' TO MSG20
					 SET SEND-DATAONLY-ALARM TO TRUE
					 PERFORM 14000-SEND-DATA-MAP
				   END-IF
				   
		   END-EVALUATE.
		   
		      EXEC CICS
		         RETURN TRANSID('STU1')
			            COMMAREA(COMMUNICATION-AREA)
		      END-EXEC.
		   
		   1000-PROCESS-KEY-MAP.
			   PERFORM 1100-RECEIVE-KEY-MAP.
			   PERFORM 1200-EDIT-KEY-DATA.
			   IF VALID-DATA
			     MOVE STUID10           TO STUID2O
				 MOVE CM-LAST-NAME      TO LNAMEO
				 MOVE CM-FIRST-NAME     TO FNAME0
				 MOVE CM-ADDRESS        TO ADDRO
				 MOVE CM-CITY           TO CITYO
				 MOVE CM-STATE          TO STATEO
				 MOVE CM-ZIP-CODE       TO ZIPCODEO
				 MOVE -1 TO LNAMEL
				 SET SEND-ERASE TO TRUE
				 PERFORM 1400-SEND-DATA-MAP
			   ELSE
			     MOVE LOW-VALUE TO STUID1O
				                   ACTION0
				 SET SEND-DATAONLY-ALARM TO TRUE
				 PERFORM 1500-SEND-KEY-MAP
			   END-IF.
			   
		   1100-RECEIVE-KEY-MAP.
		   
		   
		       EXEC CICS
			       RECEIVE MAP('STUMAP1')
				           MAPSET('STUSET1')
						   INTO(STUMAP1I)
				END-EXEC.
				
		   1200-EDIT-KEY-DATA.
		   
		       IF ACTIONI NOT = '1' AND '2' AND '3'
			       MOVE -1 TO ACTIONL
				   MOVE 'Action must be 1, 2, or 3.' TO MSG1O
				   MOVE 'N' TO VALID-DATA-SW
				END-IF.
				
				IF    STUID1L = ZERO
				   OR STUID1I = SPACE
				   MOVE -1 TO STUID1L
				   MOVE 'You must enter a student ID.' TO MSG1O
				   MOVE 'N' TO VALID-DATA-SW
			   END-IF.
			   
			   IF VALID-DATA
			       MOVE LOW-VALUE TO STUMAP2O
				   EVALUATE ACTIONI
				       WHEN '1'
					       PERFORM 1300-READ-STUDENT-RECORD
						   IF RESPONSE-CODE = DFHRESP(NOTFND)
						       MOVE ADD-INSTRUCTION TO INSTR2O
						       SET PROCESS-ADD-STUDENT TO TRUE
						       MOVE SPACE TO STUDENT-MASTER-RECORD
						   ELSE
						       IF RESPONSE-CODE = DFHRESP(NORMAL)
							      MOVE 'That student already exists.' TO MSG10 
								  MOVE 'N' TO VALID-DATA-SW
							   END-IF
						   END-IF
					   WHEN '2'
					       PERFORM 1300-READ-STUDENT-RECORD
						   IF RESPONSE-CODE = DFHRESP(NORMAL)
						      MOVE STUDENT-MASTER-RECORD TO CA-STUDENT-RECORD
							  MOVE CHANGE-INSTRUCTION TO INSTR2O
							  SET PROCESS-CHANGE-STUDENT TO TRUE
							ELSE
							   IF RESPONSE-CODE = DFHRESP(NOTFND))
							      MOVE 'That student does not exist.' TO MSG1O
								  MOVE 'N' TO VALID-DATA-SW 
							   END-IF
						   END-IF
					   WHEN '3'
					       PERFORM 1300-READ-STUDENT-RECORD
						   IF RESPONSE-CODE = DFHRESP(NORMAL)
						      MOVE STUDENT-MASTER-RECORD TO CA-STUDENT-RECORD
							  MOVE DELETE-INSTRUCTION TO INSTR2O
							  SET PROCESS-DELETE-STUDENT TO TRUE
							  MOVE ATTR-PROT TO LNAMEA
							                    FNAMEA
												ADDRA
												CITYA
												STATEA
												ZIPCODEA
							ELSE
							    IF RESPONSE-CODE = DFHRESP(NOTFND))
							      MOVE 'That student does not exist.' TO MSG1O
								  MOVE 'N' TO VALID-DATA-SW 
							   END-IF
						   END-IF
				   END-EVALUATE.
				   
		   1300-READ-STUDENT-RECORD.
		   
		       EXEC CICS
			      READ FILE('STUMAS')
				  INTO(STUDENT-MASTER-RECORD)
				  RIDFLD(STUID1I)
				  RESP(RESPONSE-CODE)
				END-EXEC.
				IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
				  AND RESPONSE-CODE NOT = DFHRESP(NOTFND)
				  PERFORM 9999-TERMINATE-PROGRAM
				END-IF.
				
		   1400-SEND-DATA-MAP.
		   
		      MOVE 'STU1' TO TRANSID2O.
			  
			  EVALUTE TRUE
			     WHEN SEND-ERASE
				    EXEC CICS
					   SEND MAP('STUMAP2')
					        MAPSET('STUSET1')
							FROM(STUMAP2O)
							ERASE
							CURSOR
					END-EXEC
				WHEN SEND-DATAONLY-ALARM
				    EXEC CICS
					   SEND MAP('STUMAP2')
					        MAPSET('STUSET1')
							FROM(STUMAP2O)
							DATAONLY
							ALARM
							CURSOR
					END-EXEC
			  END-EVALUATE.
			  
		   1500-SEND-KEY-MAP.
		   
		      MOVE 'STU1' TO TRANID1O.
			  
			  EVALUATE TRUE
			     WHEN SEND-ERASE
				    EXEC CICS
					   SEND MAP('STUMAP1')
					        MAPSET('STUSET1')
							FROM(STUMAP1O)
							ERASE
							CURSOR
					END-EXEC
				WHEN SEND-ERASE-ALARM
				   EXEC CICS
					   SEND MAP('STUMAP1')
					        MAPSET('STUSET1')
							FROM(STUMAP1O)
							ERASE
							ALARM 
							CURSOR
					END-EXEC
				WHEN SEND-DATAONLY-ALARM
				   EXEC CICS
					   SEND MAP('STUMAP1')
					        MAPSET('STUSET1')
							FROM(STUMAP1O)
							DATAONLY
							ALARM 
							CURSOR
					END-EXEC
			  END-EVALUATE.
			  
		   2000-PROCESS-ADD-STUDENT.
		   
		       PERFORM 2100-RECEIVE-DATA-MAP.
			   PERFORM 2300-WRITE-STUDENT-RECORD.
			   IF RESPONSE-CODE = DFHRESP(NORMAL)
			     MOVE 'Student record added.' TO MSG10
				 SET SEND-ERASE TO TRUE
				ELSE
				  IF RESPONSE-CODE = DFHRESP(DUPREC)
				    MOVE 'Another user has added a record 
					      'with that student ID.' TO MSG10
					SET SEND-ERASE-ALARM TO TRUE
				  END-IF
				END-IF.
				MOVE -1 TO STUID1L.
				PERFORM 1500-SEND-KEY-MAP.
				SET PROCESS-KEY-MAP TO TRUE.
				
		   2100-RECEIVE-DATA-MAP.
			
			    EXEC CICS
				   RECEIVE MAP('STUMAP2')
				           MAPSET('STUSET1')
						   INTO(STUMAP2I)
				END-EXEC.
				
				
		   2300-WRITE-STUDENT-RECORD.
		   
		       MOVE STUID2I  TO CM-STUDENT-ID.
			   MOVE LNAMEI   TO CM-LAST-NAME.
			   MOVE FNAMEI   TO CM-FIRST-NAME.
			   MOVE ADDRI    TO CM-ADDRESS.
			   MOVE CITYI    TO CM-CITY.
			   MOVE STATEI   TO CM-STATE.
			   MOVE ZIPCODEI TO CM-ZIP-CODE.
			   
			   
			   EXEC CICS
			      WRITE FILE('STUMAS')
				        FROM(STUDENT-MASTER-RECORD)
						RIDFLD(CM-STUDENT-ID)
						RESP(RESPONSE-CODE)
				END-EXEC.
				IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
				  AND RESPONSE-CODE NOT = DFHRESP(DUPREC)
				  PERFORM 9999-TERMINATE-PROGRAM
				END-IF.
				
				
		   3000-PROCESS-CHANGE-STUDENT.
		   
		      PERFORM 2100-RECEIVE-DATA-MAP.
			  MOVE STUID2I TO CM-STUDENT-ID.
			  PERFORM 3100-READ-STUDENT-FOR-UPDATE.
			  IF RESPONSE-CODE = DFHRESP(NORMAL)
			     IF STUDENT-MASTER-RECORD = CA-STUDENT-ID
				 PERFORM 3200-REWRITE-STUDENT-RECORD
				 MOVE 'Student record updated.' TO MSG10
				 SET SEND-ERASE TO TRUE
				 ELSE
				 MOVE 'Another user has updated that record
				       ' Try again.' TO MSG10
				SET SEND-ERASE-ALARM TO TRUE
				END-IF
				ELSE
				IF RESPONSE-CODE = DFHRESP(NOTFND)
				MOVE 'Anther user has deleted that record' TO MSG10
				SET SEND-ERASE-ALARM TO TRUE
				END-IF
			 END-IF.
			 MOVE -1 TO STUID1L.
			 PERFORM 1500-SEND-KEY-MAP.
			 SET PROCESS-KEY-MAP TO TRUE.
			 
		   3100-READ-STUDENT-FOR-UPDATE.
		   
		       EXEC CICS
			      READ FILE('STUMAS')
				  INTO(STUDENT-MASTER-RECORD)
				  RIDFLD(STUID1I)
				  UPDATE
				  RESP(RESPONSE-CODE)
				END-EXEC.
				IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
				  AND RESPONSE-CODE NOT = DFHRESP(NOTFND)
				  PERFORM 9999-TERMINATE-PROGRAM
				END-IF.
				
				
		   3200-REWRITE-STUDENT-RECORD.
		   
		       MOVE LNAMEI   TO CM-LAST-NAME.
			   MOVE FNAMEI   TO CM-FIRST-NAME.
			   MOVE ADDRI    TO CM-ADDRESS.
			   MOVE CITYI    TO CM-CITY.
			   MOVE STATEI   TO CM-STATE.
			   MOVE ZIPCODEI TO CM-ZIP-CODE.
				
				
				EXEC CICS
			      REWRITE FILE('STUMAS')
				        FROM(STUDENT-MASTER-RECORD)
						RIDFLD(CM-STUDENT-ID)
						RESP(RESPONSE-CODE)
				END-EXEC.
				IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
				  PERFORM 9999-TERMINATE-PROGRAM
				END-IF.
				
		   4000-PROCESS-DELETE-STUDENT.
		      MOVE CA-STUDENT-ID TO CM-STUDENT-ID.   
			  PERFORM 3100-READ-STUDENT-FOR-UPDATE.
			  IF RESPONSE-CODE = DFHRESP(NORMAL)
			     IF STUDENT-MASTER-RECORD = CA-STUDENT-ID
				 PERFORM 4100-DELETE-STUDENT-RECORD
				 MOVE 'Student deleted.' TO MSG10
				 SET SEND-ERASE TO TRUE
				 ELSE
				 MOVE 'Another user has updated that record
				       ' Try again.' TO MSG10
				SET SEND-ERASE-ALARM TO TRUE
				END-IF
				ELSE
				IF RESPONSE-CODE = DFHRESP(NOTFND)
				MOVE 'Anther user has deleted that record' TO MSG10
				SET SEND-ERASE-ALARM TO TRUE
				END-IF
			 END-IF.
			 MOVE -1 TO STUID1L.
			 PERFORM 1500-SEND-KEY-MAP.
			 SET PROCESS-KEY-MAP TO TRUE.
			 
		   4100-DELETE-STUDENT-RECORD. 
		      EXEC CICS   
			     DELETE FILE('STUMAS')
				        RESP(RESPONSE-CODE)
			   END-EXEC.
			   IF RESPONSE-CODE NOT = DFHRESP(NORMAL)
				  PERFORM 9999-TERMINATE-PROGRAM
				END-IF.
				
		   9999-TERMINATE-PROGRAM.
		      EXEC CICS
			     ABEND
			  END-EXEC.

		   
			  				   
				   
					  
					  
