      *This program allows you to edit records in the vendor file that was created using Add_New_Vendors.cbl.
IDENTIFICATION DIVISION.
PROGRAM-ID. VNDCHG01.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
COPY "SLVND01.CBL".
DATA DIVISION.
FILE SECTION.
FD VENDOR-FILE
LABEL RECORDS ARE STANDARD.
01 VENDOR-RECORD.
05 VENDOR-NUMBER PIC 9(5).
05 VENDOR-NAME PIC X(30).
05 VENDOR-ZIP PIC 9(5).
WORKING-STORAGE SECTION.
77 WHICH-FIELD PIC 9.
77 RECORD-FOUND PIC X.
77 VENDOR-NUMBER-FIELD PIC Z(5).
PROCEDURE DIVISION.
PROGRAM-BEGIN.
OPEN I-O VENDOR-FILE.
PERFORM GET-VENDOR-RECORD.
PERFORM CHANGE-RECORDS
UNTIL VENDOR-NUMBER = ZEROES.
CLOSE VENDOR-FILE.
PROGRAM-DONE.
STOP RUN.
GET-VENDOR-RECORD.
PERFORM INIT-VENDOR-RECORD.
PERFORM ENTER-VENDOR-NUMBER.
MOVE "N" TO RECORD-FOUND.
PERFORM FIND-VENDOR-RECORD
UNTIL RECORD-FOUND = "Y" OR
VENDOR-NUMBER = ZEROES.

INIT-VENDOR-RECORD.
MOVE SPACE TO VENDOR-RECORD.
MOVE ZEROES TO VENDOR-NUMBER.

ENTER-VENDOR-NUMBER.
DISPLAY " ".
DISPLAY "ENTER THE VENDOR NUMBER OF THE VENDOR".
DISPLAY "YOU WISH TO CHANGE (1 - 99999)".
DISPLAY "ENTER 0 TO STOP ENTRY".
           Display " ".

ACCEPT VENDOR-NUMBER-FIELD.
MOVE VENDOR-NUMBER-FIELD TO VENDOR-NUMBER.
FIND-VENDOR-RECORD.
PERFORM READ-VENDOR-RECORD.
IF RECORD-FOUND = "N"
DISPLAY "RECORD NOT FOUND"
PERFORM ENTER-VENDOR-NUMBER.

READ-VENDOR-RECORD.
MOVE "Y" TO RECORD-FOUND.
READ VENDOR-FILE RECORD
INVALID KEY
MOVE "N" TO RECORD-FOUND.

CHANGE-RECORDS.
PERFORM GET-FIELD-TO-CHANGE.
PERFORM CHANGE-ONE-FIELD
UNTIL WHICH-FIELD = ZERO.
PERFORM GET-VENDOR-RECORD.

GET-FIELD-TO-CHANGE.
PERFORM DISPLAY-ALL-FIELDS.
PERFORM ASK-WHICH-FIELD.

DISPLAY-ALL-FIELDS.
DISPLAY " ".
PERFORM DISPLAY-VENDOR-NUMBER.
PERFORM DISPLAY-VENDOR-NAME.
PERFORM DISPLAY-VENDOR-ZIP.

           DISPLAY " ".
DISPLAY-VENDOR-NUMBER.
DISPLAY "VENDOR NUMBER: "VENDOR-NUMBER.

DISPLAY-VENDOR-NAME.
DISPLAY "1. VENDOR NAME: "VENDOR-NAME.

DISPLAY-VENDOR-ZIP.
DISPLAY "2. VENDOR ZIP: "VENDOR-ZIP.

ASK-WHICH-FIELD.
DISPLAY "ENTER THE NUMBER OF THE FIELD TO CHANGE (1-2)".
DISPLAY "0 TO EXIT".
ACCEPT WHICH-FIELD.
IF WHICH-FIELD > 2
DISPLAY "INVALID ENTRY".

CHANGE-ONE-FIELD.
PERFORM CHANGE-THIS-FIELD.
PERFORM GET-FIELD-TO-CHANGE.

CHANGE-THIS-FIELD.
IF WHICH-FIELD = 1
PERFORM ENTER-VENDOR-NAME.
IF WHICH-FIELD = 2
PERFORM ENTER-VENDOR-ZIP.
           PERFORM REWRITE-VENDOR-RECORD.

ENTER-VENDOR-NAME.
DISPLAY "ENTER VENDOR NAME".
ACCEPT VENDOR-NAME.
ENTER-VENDOR-ZIP.
DISPLAY "ENTER VENDOR ZIP".
ACCEPT VENDOR-ZIP.

REWRITE-VENDOR-RECORD.
REWRITE VENDOR-RECORD
INVALID KEY
DISPLAY "ERROR REWRITING VENDOR RECORD".